---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTableIterator.Reset
source: html/df3e61dd-bce6-ddb1-ddad-cbc99bc3b682.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```